app/Controllers/C_Barang.php

SELECT *
FROM `barang`
---
    public function tambah()
    {
        $getGenerate = $this->barang->generateCode();
        $nourut = substr($getGenerate, 3, 4);
        $kodeBarangGenerate = $nourut + 1;
        $data = [
            'title' => 'Halaman Tambah Barang | SILOG AJS',
            'tampildatakategori' => $this->kategori->findAll(),
            'tampildatasatuan' => $this->satuan->findAll(),
            'kode_barang' => $kodeBarangGenerate,
        ];

SELECT *
FROM `barang`
WHERE `id_barang` = '16'
 LIMIT 1
SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
    public function tampil_edit_data($id = null)
    {
        $data = [
            'tampildata' => $this->barang->where('id_barang', $id)->first(),
            'tampildatakategori' => $this->kategori->findAll(),
            'tampildatasatuan' => $this->satuan->findAll(),
            'title' => 'Halaman Edit Barang | SILOG AJS',
        ];

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '21'
UPDATE `barang` SET `id_kategori` = '1', `id_satuan` = '1', `kode_barang` = NULL, `nama_barang` = 'RJ-50', `stok` = '10', `serial_number` = 'KB3234', `foto_serial_number` = '1663068207_f3bd4bebbc4f7f3e363c.jpg'
WHERE `barang`.`id_barang` IN ('21')
---
    public function edit()
    {
        $loadmodel = $this->request->getVar('id_barang');
        $dataId = $this->barang->find($loadmodel);
        $image = $this->request->getFile('foto_serial_number');
        if ($image->isValid() && !$image->hasMoved()) {
            $foto = $dataId->foto_serial_number;
            if (file_exists('uploads/' . $foto)) {
                unlink('uploads/' . $foto);
            }
            $imageName = $image->getRandomName();
            $image->move('uploads/', $imageName);
        }
        $data = [
            'id_kategori' => $this->request->getVar('id_kategori'),
            'id_satuan' => $this->request->getVar('id_satuan'),
            'kode_barang' => $this->request->getVar('kode_barang'),
            'nama_barang' => $this->request->getVar('nama_barang'),
            'stok' => $this->request->getVar('stok'),
            'serial_number' => $this->request->getVar('serial_number'),
            'foto_serial_number' => $imageName,
        ];
        session()->setFlashdata('status', 'Data Barang berhasil diupdate');
        $this->barang->update($loadmodel, $data);