app/Controllers/C_Barang_Keluar.php

    public function tambah()
    {
        $getGenerate = $this->barang_keluar->generateCode();
        $nourut = substr($getGenerate, 3, 4);
        $kodeBarangGenerate = $nourut + 1;
        $data = [
            'title' => 'Halaman Tambah Barang Keluar | SILOG AJS',
            'tampildatabarang' => $this->barang->findAll(),
---
SELECT *
FROM `barang`