app/Controllers/C_Kabel_Keluar.php

SELECT *
FROM `permintaan_kabel`
SELECT *
FROM `user`
---
    public function tambah()
    {
        $data = [
            'title' => 'Halaman Tambah kabel Keluar | SILOG AJS',
            'tampildatakabel' => $this->kabel->findAll(),
            'tampildatapermintaan' => $this->permintaan_kabel->findAll(),
            'tampildataadminwilayah' => $this->user->findAll()