app/Controllers/C_Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data = [
            'title' => "Halaman Kategori | SILOG AJS",
            'tampildata' => $this->kategori->findAll()

INSERT INTO `kategori` (`katnama`) VALUES ('Test')
---
    public function proses_tambah()
    {
        $data = [
            'katnama' => $this->request->getVar('katnama')
        ];
        session()->setFlashdata('status', 'Data Kategori berhasil ditambahkan');
        $this->kategori->insert($data);