app/Controllers/C_Kabel_Keluar.php

    public function index()
    {
        $data = [
            'title' => 'Halaman kabel Keluar | SILOG AJS',
            'tampildata' => $this->kabel_keluar->findAll(),
        ];
---
SELECT *
FROM `kabel`

                'tanggal_keluar' => $tanggal,
                'foto_penerima' => $imageName,
            ];
            $this->kabel_keluar->insert($data);
---
INSERT INTO `kabel_keluar` (`no_permintaan`, `nama`, `wilayah`, `no_telepon`, `tanggal_keluar`, `foto_penerima`) VALUES ('01/LOG/KB/Medan/19/XII/2022', 'Nur Muhammad Yahya', 'Medan', '082123298461', '2022-12-21', '1671413022_019c142fd744ce626377.jpg')

                    'panjang' => $panjang_keluar[$i]
                );
            }
            $this->detail_kabel_keluar->table('detail_kabel_keluar')->insertBatch($data1);
            $this->kabel->table('kabel')->updateBatch($data2, 'id_kabel');
---
INSERT INTO `detail_kabel_keluar` (`core`, `id_kabel_keluar`, `nama_satuan`, `no_drum`, `panjang`) VALUES ('48',4,'Meter','23-A2921457','21 Meter'), ('48',4,'Meter','22-A2921454','43 Meter')
UPDATE `kabel` SET `panjang` = CASE 
WHEN `id_kabel` = '2' THEN '3924'
WHEN `id_kabel` = '1' THEN '3891'
ELSE `panjang` END
WHERE `id_kabel` IN('2','1')

                    'status' => 5
                );
            }
            $this->history_permintaan_kabel->table('history_permintaan_kabel')->insertBatch($data3);
---
INSERT INTO `history_permintaan_kabel` (`core`, `nama`, `nama_satuan`, `no_drum`, `no_permintaan`, `no_telepon`, `panjang`, `req_id`, `status`, `tanggal`, `wilayah`) VALUES ('48','Nur Muhammad Yahya','Meter','23-A2921457','01/LOG/KB/Medan/19/XII/2022','082123298461','21 Meter','1',5,'2022-12-21','Medan'), ('48','Nur Muhammad Yahya','Meter','22-A2921454','01/LOG/KB/Medan/19/XII/2022','082123298461','43 Meter','1',5,'2022-12-21','Medan')