app/Controllers/C_Material_Masuk.php

SELECT *
FROM `material`
---
    public function tambah()
    {
        $data = [
            'title' => 'Halaman Tambah material Masuk | SILOG AJS',
            'tampildatamaterial' => $this->material->findAll()