app/Controllers/C_Material_Keluar.php

SELECT *
FROM `material`
SELECT *
FROM `material_keluar`
---
    public function index()
    {
        $data = [
            'title' => 'Halaman Material Keluar | SILOG AJS',
            'tampildata' => $this->material_keluar->findAll(),
        ];