app/Controllers/C_Material_Keluar.php

SELECT *
FROM `user`
---
    public function tambah()
    {
        $data = [
            'title' => 'Halaman Tambah material Keluar | SILOG AJS',
            'tampildatamaterial' => $this->material->findAll(),
            'tampildatapermintaan' => $this->permintaan->findAll(),
            'tampildataadminwilayah' => $this->user->findAll()