app/Controllers/C_Material.php

    public function proses_tambah()
    {
        $image = $this->request->getFile('foto_serial_number');
        $image->move(ROOTPATH . 'public/uploads');
        $data = [
            'id_kategori' => $this->request->getVar('id_kategori'),
            'id_satuan' => $this->request->getVar('id_satuan'),
            'nama_material' => $this->request->getVar('nama_material'),
            'stok' => $this->request->getVar('stok'),
            'serial_number' => $this->request->getVar('serial_number'),
            'foto_serial_number' => $image->getClientName(),
        ];
        session()->setFlashdata('status', 'Data material berhasil ditambahkan');
        $this->material->insert($data);
---
INSERT INTO `material` (`id_satuan`, `nama_material`, `stok`, `serial_number`, `foto_serial_number`) VALUES ('2', 'Tang Krimping', '10', 'KB3234', 'Serial_number.png')