app/Controllers/C_Transaksi.php

SELECT *
FROM `barang_keluar`
WHERE `id_barang_keluar` = '1'
 LIMIT 1
SELECT *
FROM `barang`
---
    public function detail($id = null)
    {
        $data = [
            'tampildata' => $this->barang_keluar->where('id_barang_keluar', $id)->first(),
            'tampildatabarang' => $this->barang->findAll(),
            'title' => "Halaman Detail Barang Keluar | SILOG AJS"
        ];