app/Controllers/C_User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $data = [
            'title' => 'Halaman Manajemen User | SILOG AJS',
            'tampildata' => $this->user->findAll(),