app/Models/M_Barang_Keluar.php

    function getAll()
    {
        $builder = $this->db->table('barang_keluar');
        $builder->join('barang', 'barang.id_barang = barang_keluar.id_barang');
        $query = $builder->get();
---
SELECT *
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`