app/Models/M_Barang.php

SELECT *
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
JOIN `satuan` ON `satuan`.`id_satuan` = `barang`.`id_satuan`
---
    function getAll()
    {
        $builder = $this->db->table('barang');
        $builder->join('kategori', 'kategori.id_kategori = barang.id_kategori');
        $builder->join('satuan', 'satuan.id_satuan = barang.id_satuan');
        $query = $builder->get();

SELECT *
FROM `barang_masuk`
WHERE `id_barang_masuk` LIKE 'BRM2201%' ESCAPE '!'
---
    public function chartBarangMasuk($bulan)
	{
		$like = 'BRM' . date('y') . $bulan;
        $builder = $this->db->table('barang_masuk');
        $builder->like('id_barang_masuk', $like, 'after');
        $query = $builder->get();

SELECT *
FROM `barang_keluar`
WHERE `id_barang_keluar` LIKE 'BKR2201%' ESCAPE '!'
---
	public function chartBarangKeluar($bulan)
	{
		$like = 'BKR' . date('y') . $bulan;
        $builder = $this->db->table('barang_keluar');
        $builder->like('id_barang_keluar', $like, 'after');
        $query = $builder->get();