app/Models/M_Detail_Material_Keluar.php

SELECT COUNT(*) AS `numrows`
FROM `detail_material_keluar`
---
    function countMaterialKeluar()
    {
        $builder = $this->db->table('detail_material_keluar');
        $builder->selectCount('id_material_keluar as material_keluar');
        $query = $builder->countAllResults();