app/Models/M_Detail_Kabel_Keluar.php

    function countKabelKeluar()
    {
        $builder = $this->db->table('detail_kabel_keluar');
        $builder->selectCount('id_kabel as kabel_keluar');
        // $builder->where('status = 4');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `detail_kabel_keluar`