app/Models/M_Detail_Permintaan_Kabel.php

SELECT *
FROM `kabel`
JOIN `detail_permintaan_kabel` ON `detail_permintaan_kabel`.`id_kabel` = `kabel`.`id_kabel`
JOIN `permintaan_kabel` ON `permintaan_kabel`.`id_permintaan_kabel` = `detail_permintaan_kabel`.`id_permintaan_kabel`
WHERE `permintaan_kabel`.`id_permintaan_kabel` = '3'
---
    function getAllRelation($id)
    {
        $builder = $this->db->table('kabel');
        $builder->join('detail_permintaan_kabel', 'detail_permintaan_kabel.id_kabel = kabel.id_kabel');
        $builder->join('permintaan_kabel', 'permintaan_kabel.id_permintaan_kabel = detail_permintaan_kabel.id_permintaan_kabel');
        $builder->where('permintaan_kabel.id_permintaan_kabel', $id);
        $query = $builder->get();

UPDATE `detail_permintaan_kabel` SET `status` = 5
WHERE `no_permintaan` = '01/LOG/KB/Medan/19/XII/2022'
AND `status` = 4
---
    function updateStatus($id_permintaan_kabel)
    {
        $builder = $this->db->table('detail_permintaan_kabel');
        $array = ['id_permintaan_kabel' => $id_permintaan_kabel,  'status' =>  4];
        $builder->join('permintaan_kabel', 'detail_permintaan_kabel.id_permintaan_kabel = permintaan_kabel.id_permintaan_kabel')->set('status', 5)->where($array)->update();

DELETE FROM `detail_permintaan_kabel`
WHERE `status` = 5
---
    function deleteData($id_permintaan_kabel)
    {
        $builder = $this->db->table('detail_permintaan_kabel');
        $array = array('id_permintaan_kabel' => $id_permintaan_kabel);
        $status = [5, 6];
        $builder->join('permintaan_kabel', 'detail_permintaan_kabel.id_permintaan_kabel = permintaan_kabel.id_permintaan_kabel')->where($array)->whereIn('status', $status)->delete();