app/Models/M_Kabel_Keluar.php

SELECT *
FROM `kabel_keluar`
JOIN `permintaan_kabel` ON `permintaan_kabel`.`id_permintaan_kabel` = `kabel_keluar`.`id_permintaan_kabel`
JOIN `user` ON `user`.`id` = `permintaan_kabel`.`id`
---
    function getAll()
    {
        $builder = $this->db->table('kabel_keluar');
        $builder->join('permintaan_kabel', 'permintaan_kabel.id_permintaan_kabel = kabel_keluar.id_permintaan_kabel');
        $builder->join('user', 'user.id = permintaan_kabel.id');
        $query = $builder->get();

SELECT *
FROM `permintaan_kabel`
JOIN `user` ON `user`.`id` = `permintaan_kabel`.`id`
JOIN `detail_permintaan_kabel` ON `detail_permintaan_kabel`.`id_permintaan_kabel` = `permintaan_kabel`.`id_permintaan_kabel`
JOIN `kabel` ON `kabel`.`id_kabel` = `detail_permintaan_kabel`.`id_kabel`
WHERE `permintaan_kabel`.`id_permintaan_kabel` = '1'
---
    public function cekWilayah($id = null)
    {
        $builder = $this->db->table('permintaan_kabel');
        $builder->join('user', 'user.id = permintaan_kabel.id');
        $builder->join('detail_permintaan_kabel', 'detail_permintaan_kabel.id_permintaan_kabel = permintaan_kabel.id_permintaan_kabel');
        $builder->join('kabel', 'kabel.id_kabel = detail_permintaan_kabel.id_kabel');
        $builder->join('kabel_keluar', 'kabel_keluar.id_permintaan_kabel = detail_permintaan_kabel.id_permintaan_kabel');
        $builder->where('permintaan_kabel.id_permintaan_kabel', $id);
        $query = $builder->get();