app/Models/M_Kabel.php

SELECT COUNT(*) AS `numrows`
FROM `kabel`
---
    function count($table)
    {
        $builder = $this->db->table($table);
        $query = $builder->countAllResults();