app/Models/M_Material_Keluar.php

SELECT *
FROM `material_keluar`
JOIN `permintaan_material` ON `permintaan_material`.`id_permintaan_material` = `material_keluar`.`id_permintaan_material`
JOIN `user` ON `user`.`id` = `permintaan_material`.`id`
---
    function getAll()
    {
        $builder = $this->db->table('material_keluar');
        $builder->join('material', 'material.id_material = material_keluar.id_material');
        $builder->join('permintaan_material', 'permintaan_material.id_permintaan_material = material_keluar.id_permintaan_material');
        $query = $builder->get();