app/Models/M_Material_Masuk.php

SELECT *
FROM `material_masuk`
JOIN `material` ON `material`.`id_material` = `material_masuk`.`id_material`
---
    function getAll()
    {
        $builder = $this->db->table('material_masuk');
        $builder->join('material', 'material.id_material = material_masuk.id_material');
        $query = $builder->get();