app/Models/M_Material.php

SELECT *
FROM `material`
JOIN `satuan` ON `satuan`.`id_satuan` = `material`.`id_satuan`
---
    function getAll()
    {
        $builder = $this->db->table('material');
        $builder->join('satuan', 'satuan.id_satuan = material.id_satuan');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `material`
---
    function count($table)
    {
        $builder = $this->db->table($table);
        $query = $builder->countAllResults();