app/Models/M_Permintaan_Kabel.php

    function getAll()
    {
        $builder = $this->db->table('permintaan_kabel');
        $builder->join('user', 'user.id = permintaan_kabel.id');
        $query = $builder->get();
---
SELECT *
FROM `permintaan_kabel`
JOIN `user` ON `user`.`id` = `permintaan_kabel`.`id`

    function getById($id)
    {
        $builder = $this->db->table('permintaan_kabel');
        $builder->join('user', 'user.id = permintaan_kabel.id');
        $builder->where('permintaan_kabel.id_permintaan_kabel', $id);
        $query = $builder->get();
---
SELECT *
FROM `permintaan_kabel`
JOIN `user` ON `user`.`id` = `permintaan_kabel`.`id`
WHERE `permintaan_kabel`.`id_permintaan_kabel` = '3'