app/Models/M_User.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `jabatan` = "Admin Wilayah"
---
    function count_where_location()
    {
        $builder = $this->db->table('user');
        $builder->where('jabatan="Admin Wilayah"');
        $query = $builder->countAllResults();;